; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v10)
             (pred_8 ?v4 ?v11)
             (pred_9 ?v8 ?v11)
             (pred_5 ?v13 ?v8 )
	     (pred_7 ?v8)
             (pred_6 ?v9)
             (pred_1 ?v4)
             (pred_2 ?v11)
             (pred_3 ?v8)
             (pred_4 ?v4)
             (pred_12 ?v8)
             (pred_10 ))



(:action op_5
:parameters (?v3 ?v2 ?v1 ?v5)
:precondition (and (pred_6 ?v3) (pred_6 ?v2) (pred_1 ?v1) (pred_2 ?v5)
          (pred_11 ?v3 ?v2) (pred_8 ?v1 ?v5)
                   (pred_9 ?v2 ?v5) (pred_7 ?v3) 
                   (pred_3 ?v2) (pred_4 ?v1))
:effect (and  (pred_12 ?v2) (not (pred_3 ?v2))))


(:action op_4
:parameters (?v3 ?v12)
:precondition (and (pred_6 ?v3) (pred_6 ?v12)
               (pred_7 ?v3) (pred_11 ?v3 ?v12) (pred_12 ?v12))
:effect (and (pred_7 ?v12) (not (pred_7 ?v3))))

(:action op_3
:parameters (?v3 ?v1)
:precondition (and (pred_6 ?v3) (pred_1 ?v1) 
                  (pred_7 ?v3) (pred_5 ?v1 ?v3) (pred_10 ))
:effect (and (pred_4 ?v1)
   (not (pred_5 ?v1 ?v3)) (not (pred_10 ))))


(:action op_2
:parameters (?v3 ?v6 ?v7)
:precondition (and (pred_6 ?v3) (pred_1 ?v6) (pred_1 ?v7)
                  (pred_7 ?v3) (pred_4 ?v7) (pred_5 ?v6 ?v3))
:effect (and (pred_4 ?v6) (pred_5 ?v7 ?v3)
        (not (pred_4 ?v7)) (not (pred_5 ?v6 ?v3))))

(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_6 ?v3) (pred_1 ?v1) 
                  (pred_7 ?v3) (pred_4 ?v1))
:effect (and (pred_10 ) (pred_5 ?v1 ?v3) (not (pred_4 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_16 obj_03 obj_12 obj_01 obj_11 obj_10 obj_04 obj_17 obj_05 obj_14 obj_02 obj_07 obj_19 obj_08 obj_15
    obj_20 obj_13
    obj_18 obj_09
    )

    (:init
       (pred_10)

       (pred_6 obj_06)
       (pred_6 obj_16)
       (pred_6 obj_03)
       (pred_6 obj_12)
       (pred_6 obj_01)
       (pred_6 obj_11)
       (pred_6 obj_10)
       (pred_6 obj_04)
       (pred_6 obj_17)
       (pred_6 obj_05)
       (pred_6 obj_14)
       (pred_6 obj_02)
       (pred_6 obj_07)
       (pred_6 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_15)
       (pred_2 obj_20)
       (pred_2 obj_13)
       (pred_1 obj_18)
       (pred_1 obj_09)

       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_16)
       (pred_11 obj_16 obj_11)
       (pred_11 obj_16 obj_03)
       (pred_11 obj_16 obj_06)
       (pred_11 obj_03 obj_10)
       (pred_11 obj_03 obj_12)
       (pred_11 obj_03 obj_16)
       (pred_11 obj_12 obj_04)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_11 obj_05)
       (pred_11 obj_11 obj_10)
       (pred_11 obj_11 obj_16)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_10 obj_14)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_10 obj_03)
       (pred_11 obj_10 obj_11)
       (pred_11 obj_04 obj_02)
       (pred_11 obj_04 obj_12)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_17 obj_07)
       (pred_11 obj_17 obj_05)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_05 obj_19)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_11)
       (pred_11 obj_05 obj_17)
       (pred_11 obj_14 obj_08)
       (pred_11 obj_14 obj_02)
       (pred_11 obj_14 obj_10)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_02 obj_15)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_02 obj_14)
       (pred_11 obj_07 obj_19)
       (pred_11 obj_07 obj_17)
       (pred_11 obj_19 obj_08)
       (pred_11 obj_19 obj_05)
       (pred_11 obj_19 obj_07)
       (pred_11 obj_08 obj_15)
       (pred_11 obj_08 obj_14)
       (pred_11 obj_08 obj_19)
       (pred_11 obj_15 obj_02)
       (pred_11 obj_15 obj_08)
       (pred_3 obj_16)
       (pred_3 obj_04)
       (pred_9  obj_16 obj_20)
       (pred_9  obj_04 obj_13)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_12)
       (pred_12 obj_01)
       (pred_12 obj_11)
       (pred_12 obj_10)
       (pred_12 obj_17)
       (pred_12 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_02)
       (pred_12 obj_07)
       (pred_12 obj_19)
       (pred_12 obj_08)
       (pred_12 obj_15)

       (pred_8  obj_18 obj_20)
       (pred_8  obj_09 obj_13)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_09 obj_02)
       (pred_7 obj_12)
    )

    (:goal (and
       (pred_5 obj_09 obj_05)
    ))
(:constraints
  (always (not (pred_7 obj_14)))
)
)

; plan
1. (op_4 obj_12 obj_03)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_03)
   goals met: 0 of 1
2. (op_3 obj_03 obj_18)
   deleted: (pred_5 obj_18 obj_03) (pred_10)
   added: (pred_4 obj_18)
   goals met: 0 of 1
3. (op_4 obj_03 obj_10)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_10)
   goals met: 0 of 1
4. (op_4 obj_10 obj_11)
   deleted: (pred_7 obj_10)
   added: (pred_7 obj_11)
   goals met: 0 of 1
5. (op_4 obj_11 obj_05)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_05)
   goals met: 0 of 1
6. (op_1 obj_05 obj_18)
   deleted: (pred_4 obj_18)
   added: (pred_10) (pred_5 obj_18 obj_05)
   goals met: 0 of 1
7. (op_4 obj_05 obj_19)
   deleted: (pred_7 obj_05)
   added: (pred_7 obj_19)
   goals met: 0 of 1
8. (op_4 obj_19 obj_08)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_08)
   goals met: 0 of 1
9. (op_4 obj_08 obj_15)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_15)
   goals met: 0 of 1
10. (op_4 obj_15 obj_02)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_02)
   goals met: 0 of 1
11. (op_3 obj_02 obj_09)
   deleted: (pred_5 obj_09 obj_02) (pred_10)
   added: (pred_4 obj_09)
   goals met: 0 of 1
12. (op_4 obj_02 obj_15)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_15)
   goals met: 0 of 1
13. (op_4 obj_15 obj_08)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_08)
   goals met: 0 of 1
14. (op_4 obj_08 obj_19)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_19)
   goals met: 0 of 1
15. (op_4 obj_19 obj_05)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_05)
   goals met: 0 of 1
16. (op_2 obj_05 obj_18 obj_09)
   deleted: (pred_4 obj_09) (pred_5 obj_18 obj_05)
   added: (pred_4 obj_18) (pred_5 obj_09 obj_05)
   goals met: 1 of 1
